create_de_open.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <s:Header>
      <a:Action s:mustUnderstand="1">Create</a:Action>
      <a:MessageID>urn:uuid:7e0cca04-57bd-4481-864c-6ea8039d2ea0</a:MessageID>
      <a:ReplyTo>
         <a:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
      </a:ReplyTo>
      <a:To s:mustUnderstand="1">{{soapEndPoint}}</a:To>
      <o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
         <o:UsernameToken>
            <o:Username>{{soapUsername}}</o:Username>
            <o:Password><![CDATA[{{soapPassword}}]]></o:Password>
         </o:UsernameToken>
      </o:Security>
   </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <!--
            <Options>
             <SendResponseTo>
          <ResponseType>email</ResponseType>
          <ResponseAddress>your_address@salesforce.com</ResponseAddress>
          <RespondWhen>OnCallComplete</RespondWhen>
          <IncludeResults>true</IncludeResults>
          <IncludeObjects>true</IncludeObjects>
         </SendResponseTo>
             <RequestType>Asynchronous</RequestType>
            </Options>
        -->
         <Objects xsi:type="DataExtension">
            <!--
            <Client>
                <ID>000000</ID>
            </Client>
            -->
            <CustomerKey>OPEN</CustomerKey>
            <Name>OPEN</Name>
            <!-- Specify folder DE created in -->
            <CategoryID>0000</CategoryID>
            <IsSendable>false</IsSendable>
            <Fields>
                <Field>
                    <CustomerKey>ACCOUNTID</CustomerKey>
                    <Name>ACCOUNTID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>OYBACCOUNTID</CustomerKey>
                    <Name>OYBACCOUNTID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>false</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>JOBID</CustomerKey>
                    <Name>JOBID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>LISTID</CustomerKey>
                    <Name>LISTID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>BATCHID</CustomerKey>
                    <Name>BATCHID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>SUBSCRIBERID</CustomerKey>
                    <Name>SUBSCRIBERID</Name>
                    <FieldType>Number</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>
                <Field>
                    <CustomerKey>SUBSCRIBERKEY</CustomerKey>
                    <Name>SUBSCRIBERKEY</Name>
                    <FieldType>Text</FieldType>
                    <MaxLength>254</MaxLength>
                    <IsRequired>true</IsRequired>
                </Field>
                 <Field>
                    <CustomerKey>EVENTDATE</CustomerKey>
                    <Name>EVENTDATE</Name>
                    <DataType>Date</DataType>
                    <IsRequired>true</IsRequired>
                    <FieldType>Date</FieldType>
                </Field>  
                <Field>
                    <CustomerKey>DOMAIN</CustomerKey>
                    <Name>DOMAIN</Name>
                    <FieldType>Text</FieldType>
                    <MaxLength>128</MaxLength>
                    <IsRequired>true</IsRequired>
                </Field> 
                <Field>
                    <CustomerKey>ISUNIQUE</CustomerKey>
                    <Name>ISUNIQUE</Name>
                    <FieldType>Boolean</FieldType>
                    <IsRequired>true</IsRequired>
                </Field>  
                <Field>
                    <CustomerKey>TRIGGERERSENDDEFINITIONOBJECTID</CustomerKey>
                    <Name>TRIGGERERSENDDEFINITIONOBJECTID</Name>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                    <IsRequired>false</IsRequired>
                </Field>  
                 <Field>
                    <CustomerKey>TRIGGEREDSENDCUSTOMERKEY</CustomerKey>
                    <Name>TRIGGEREDSENDCUSTOMERKEY</Name>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                    <IsRequired>false</IsRequired>
                </Field>          
              </Fields>
         </Objects>
    </CreateRequest>
  </s:Body>
</s:Envelope>